[
  {
    "id": "a06c2a71-8c5c-4f2d-ae34-af2d047e8259",
    "name": "Lentil Soup",
    "postedDate": 1682899200000,
    "ingredients": [
      "1 cup green or brown lentils",
      "1 onion, chopped",
      "2 carrots, chopped",
      "2 celery stalks, chopped",
      "4 cups vegetable broth",
      "1 tsp cumin",
      "1 tsp paprika",
      "1 bay leaf",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "Rinse lentils under cold water.",
      "In a large pot, sauté onion, carrots, and celery until softened.",
      "Add lentils, vegetable broth, cumin, paprika, bay leaf, salt, and pepper.",
      "Bring to a boil, then reduce heat and simmer for 30-40 minutes or until lentils are tender.",
      "Remove bay leaf and serve."
    ]
  },
  {
    "id": "6f23a225-d306-42b8-81b0-3c46d47ebccc",
    "name": "Quinoa Stuffed Peppers",
    "postedDate": 1682985600000,
    "ingredients": [
      "4 bell peppers, any color",
      "1 cup cooked quinoa",
      "1 can black beans, drained and rinsed",
      "1 cup corn",
      "1 onion, chopped",
      "1 clove garlic, minced",
      "1 tsp cumin",
      "1 tsp chili powder",
      "Salt and pepper to taste",
      "1 cup shredded cheese (optional)"
    ],
    "instructions": [
      "Preheat oven to 350°F (175°C).",
      "Cut the tops off the peppers and remove seeds.",
      "In a large bowl, mix quinoa, black beans, corn, onion, garlic, cumin, chili powder, salt, and pepper.",
      "Stuff each pepper with the quinoa mixture.",
      "Place stuffed peppers in a baking dish and cover with foil.",
      "Bake for 30 minutes, then remove foil.",
      "Top with cheese if desired and bake for an additional 10 minutes or until cheese is melted.",
      "Serve warm."
    ]
  },
  {
    "id": "5a11e0f6-7f63-487e-9d64-725589c865d3",
    "name": "Vegan Chickpea Curry",
    "postedDate": 1683072000000,
    "ingredients": [
      "1 can chickpeas, drained and rinsed",
      "1 can diced tomatoes",
      "1 can coconut milk",
      "1 onion, chopped",
      "2 cloves garlic, minced",
      "1 tbsp ginger, minced",
      "1 tbsp curry powder",
      "1 tsp turmeric",
      "1 tsp cumin",
      "1 tsp paprika",
      "Salt and pepper to taste",
      "2 cups spinach"
    ],
    "instructions": [
      "In a large pot, sauté onion, garlic, and ginger until softened.",
      "Add curry powder, turmeric, cumin, and paprika, and cook for 1 minute.",
      "Add chickpeas, diced tomatoes, and coconut milk.",
      "Bring to a boil, then reduce heat and simmer for 20-25 minutes.",
      "Add spinach and cook until wilted.",
      "Season with salt and pepper to taste.",
      "Serve over rice or with naan bread."
    ]
  },
  {
    "id": "d8dcbfb5-66b6-42dd-9f0d-4507ee046c95",
    "name": "Cauliflower Fried Rice",
    "postedDate": 1683244800000,
    "ingredients": [
      "1 large head cauliflower, riced",
      "2 tbsp vegetable oil",
      "1 onion, chopped",
      "2 cloves garlic, minced",
      "1 cup frozen peas and carrots",
      "2 eggs, beaten (optional)",
      "3 tbsp soy sauce",
      "1 tsp sesame oil",
      "Green onions for garnish"
    ],
    "instructions": [
      "Heat vegetable oil in a large skillet or wok over medium heat.",
      "Add onion and garlic, and cook until softened.",
      "Add riced cauliflower and cook for 3-4 minutes, stirring occasionally.",
      "Add peas and carrots, and cook until heated through.",
      "If using eggs, push the cauliflower mixture to one side of the skillet and pour beaten eggs on the other side. Scramble the eggs and mix them with the cauliflower.",
      "Stir in soy sauce and sesame oil.",
      "Garnish with green onions and serve."
    ]
  },
  {
    "id": "7b9e2625-97a3-4c3c-8e9c-0e74a97fc6f9",
    "name": "Vegetarian Fajitas",
    "postedDate": 1683331200000,
    "ingredients": [
      "2 bell peppers, sliced",
      "1 red onion, sliced",
      "1 zucchini, sliced",
      "2 tbsp olive oil",
      "1 tbsp chili powder",
      "1 tsp cumin",
      "1 tsp paprika",
      "1/2 tsp garlic powder",
      "Salt and pepper to taste",
      "8 small flour tortillas",
      "Optional toppings: sour cream, salsa, guacamole, shredded cheese"
    ],
    "instructions": [
      "Preheat oven to 400°F (200°C).",
      "Toss bell peppers, onion, and zucchini with olive oil, chili powder, cumin, paprika, garlic powder, salt, and pepper.",
      "Spread vegetables in a single layer on a baking sheet.",
      "Roast for 20-25 minutes or until tender.",
      "Serve with warm tortillas and desired toppings."
    ]
  },
  {
    "id": "b127cf4c-e5e0-4fc1-b6a9-7a1030ceec89",
    "name": "Vegan Pesto Pasta",
    "postedDate": 1683417600000,
    "ingredients": [
      "12 oz pasta of choice",
      "2 cups fresh basil leaves",
      "1/2 cup pine nuts",
      "2 cloves garlic",
      "1/2 cup olive oil",
      "1/4 cup nutritional yeast",
      "Salt and pepper to taste",
      "1 cup cherry tomatoes, halved"
    ],
    "instructions": [
      "Cook pasta according to package instructions.",
      "In a food processor, combine basil, pine nuts, garlic, olive oil, nutritional yeast, salt, and pepper. Process until smooth.",
      "Drain pasta and return to pot.",
      "Stir in pesto sauce and cherry tomatoes.",
      "Serve warm or cold."
    ]
  },
  {
    "id": "0b7d60d0-1a2a-4f62-964a-9e1c3d486b6b",
    "name": "Vegan Tofu Stir Fry",
    "postedDate": 1684368000000,
    "ingredients": [
      "1 block firm tofu, drained and cubed",
      "2 cups mixed vegetables (bell peppers, broccoli, snow peas, etc.)",
      "1 onion, sliced",
      "2 cloves garlic, minced",
      "1 tbsp ginger, minced",
      "2 tbsp soy sauce",
      "1 tbsp cornstarch",
      "2 tbsp vegetable oil",
      "Salt and pepper to taste",
      "2 green onions, chopped for garnish"
    ],
    "instructions": [
      "In a large pan, heat the oil over medium-high heat.",
      "Add the tofu cubes and cook until golden brown on all sides.",
      "Remove the tofu and set aside.",
      "In the same pan, sauté onion, garlic, and ginger until softened.",
      "Add the mixed vegetables and cook until tender.",
      "In a small bowl, mix soy sauce and cornstarch to make a slurry. Pour this over the vegetables.",
      "Add the cooked tofu back into the pan and stir to combine.",
      "Season with salt and pepper to taste.",
      "Garnish with chopped green onions before serving."
    ]
  },
  {
    "id": "8b60b3a5-8421-4f8b-9c4e-d0165c6c1415",
    "name": "Vegan Avocado Pasta",
    "postedDate": 1684627200000,
    "ingredients": [
      "2 ripe avocados",
      "2 cloves garlic",
      "1/4 cup fresh basil leaves",
      "1 tbsp lemon juice",
      "Salt and pepper to taste",
      "2 tbsp olive oil",
      "200g spaghetti",
      "Cherry tomatoes and fresh basil for garnish"
    ],
    "instructions": [
      "Cook the spaghetti according to package instructions.",
      "In a food processor, combine avocados, garlic, basil leaves, and lemon juice. Process until smooth.",
      "While the processor is running, slowly add the olive oil until well combined.",
      "Season the avocado sauce with salt and pepper to taste.",
      "Drain the cooked spaghetti and return it to the pot. Pour the avocado sauce over the pasta and toss to combine.",
      "Serve the pasta with cherry tomatoes and fresh basil leaves as garnish."
    ]
  },
  {
    "id": "f15f8c0d-98c5-4a07-81e0-319e1be9f586",
    "name": "Chicken Alfredo Pasta",
    "postedDate": 1684713600000,
    "ingredients": [
      "2 chicken breasts, cubed",
      "2 cups fettuccine pasta",
      "2 tbsp olive oil",
      "2 cloves garlic, minced",
      "1 cup heavy cream",
      "1 cup grated Parmesan cheese",
      "Salt and pepper to taste",
      "Fresh parsley for garnish"
    ],
    "instructions": [
      "Cook the fettuccine according to package instructions.",
      "Heat the olive oil in a large skillet over medium heat. Add the chicken and cook until browned and no longer pink inside.",
      "Add the garlic to the skillet and sauté for 1 minute.",
      "Add the heavy cream to the skillet and bring to a simmer.",
      "Stir in the Parmesan cheese until it melts into the sauce. Season with salt and pepper to taste.",
      "Drain the pasta and add it to the skillet. Toss until the pasta is coated with the sauce.",
      "Garnish with fresh parsley before serving."
    ]
  },
  {
    "id": "e5df2c12-7523-44f2-97ea-dc9ff55f51d6",
    "name": "Beef Stir Fry",
    "postedDate": 1684886400000,
    "ingredients": [
      "500g beef sirloin, thinly sliced",
      "2 tbsp soy sauce",
      "2 tbsp cornstarch",
      "2 cloves garlic, minced",
      "1 inch piece of ginger, minced",
      "1 onion, sliced",
      "1 bell pepper, sliced",
      "1 carrot, sliced",
      "2 tbsp vegetable oil",
      "2 tbsp oyster sauce",
      "Salt and pepper to taste",
      "Sesame seeds for garnish"
    ],
    "instructions": [
      "In a bowl, combine the sliced beef, soy sauce, and cornstarch. Let it marinate for 15 minutes.",
      "Heat the oil in a large pan over high heat. Add the beef and stir-fry until browned. Remove from the pan and set aside.",
      "In the same pan, add the garlic and ginger, and sauté until fragrant.",
      "Add the onion, bell pepper, and carrot to the pan. Stir-fry until the vegetables are tender.",
      "Return the beef to the pan. Add the oyster sauce and stir to combine. Cook for another 2 minutes.",
      "Season with salt and pepper to taste.",
      "Garnish with sesame seeds before serving."
    ]
  },
  {
    "id": "2ab2e683-21c3-4907-ae6f-3b1d5a8e40c9",
    "name": "Spicy Chicken Tacos",
    "postedDate": 1684886400000,
    "ingredients": [
      "500g chicken breast, cut into strips",
      "2 tbsp olive oil",
      "1 onion, sliced",
      "2 cloves garlic, minced",
      "1 jalapeno, sliced",
      "1 tbsp chili powder",
      "1 tsp cumin",
      "1/2 tsp cayenne pepper",
      "Salt and pepper to taste",
      "8 small tortillas",
      "1 cup shredded lettuce",
      "1 tomato, diced",
      "1/2 cup shredded cheddar cheese",
      "Sour cream and salsa for serving"
    ],
    "instructions": [
      "Heat the oil in a large pan over medium heat. Add the chicken and cook until browned and no longer pink inside. Remove from the pan and set aside.",
      "In the same pan, add the onion, garlic, and jalapeno, and sauté until softened.",
      "Return the chicken to the pan. Add the chili powder, cumin, and cayenne pepper, and stir to combine. Cook for another 2 minutes.",
      "Season with salt and pepper to taste.",
      "To assemble the tacos, place a scoop of the chicken mixture on a tortilla. Top with lettuce, tomato, and cheddar cheese. Repeat with the remaining tortillas.",
      "Serve the tacos with sour cream and salsa on the side."
    ]
  },
  {
    "id": "6b64b3b0-128f-4ae6-9862-64f1b21eef98",
    "name": "Traditional Idli",
    "postedDate": 1684886400000,
    "ingredients": [
      "2 cups idli rice or parboiled rice",
      "1 cup urad dal (skinned black lentils)",
      "1/2 tsp fenugreek seeds",
      "Salt to taste",
      "Water as needed",
      "Idli steamer or pressure cooker without whistle"
    ],
    "instructions": [
      "Rinse the idli rice and urad dal separately under running water until the water runs clear. Soak the rice and dal along with fenugreek seeds in separate bowls for 5-6 hours.",
      "After soaking, grind the urad dal with a little water until it forms a smooth and fluffy batter. Transfer to a large bowl.",
      "Now grind the rice with a little water until it forms a slightly grainy batter. Combine this with the urad dal batter in the large bowl.",
      "Add salt to the mixture and mix well. Let the batter ferment in a warm place for 8-10 hours or overnight. The batter should rise and increase in volume.",
      "When you're ready to cook, grease the idli moulds with a little oil. Fill each mould with the fermented batter.",
      "Place the filled moulds in a steamer or pressure cooker (without the whistle) containing a little water at the bottom. Steam for 10-12 minutes or until a toothpick inserted into the idli comes out clean.",
      "Remove the idli from the moulds using a spoon or a knife. Serve hot with sambar and coconut chutney."
    ]
  },
  {
    "id": "3d9ec60b-0c89-47b4-afe3-d52bb71ad4b6",
    "name": "Very Spicy Chicken Curry",
    "postedDate": 1698105600000,
    "ingredients": [
      "500g boneless chicken, cut into small pieces",
      "2 onions, finely chopped",
      "3 tomatoes, chopped",
      "3 green chilies, slit",
      "1/4 cup yogurt",
      "2 tsp red chili powder",
      "1 tsp turmeric powder",
      "1 tsp garam masala",
      "1 tsp cumin seeds",
      "4-5 cloves garlic, minced",
      "1-inch piece of ginger, minced",
      "Salt to taste",
      "2 tbsp vegetable oil",
      "Fresh cilantro for garnish"
    ],
    "instructions": [
      "Heat vegetable oil in a pan over medium heat. Add cumin seeds and let them splutter.",
      "Add chopped onions and sauté until they turn golden brown.",
      "Add minced garlic, ginger, and green chilies. Sauté for a few minutes until the raw smell disappears.",
      "Add red chili powder, turmeric, and salt. Cook the spices for a minute or two.",
      "Add chopped tomatoes and cook until they turn soft and the oil starts to separate from the masala.",
      "Stir in the chicken pieces and cook until they turn white and are sealed.",
      "Whisk yogurt and add it to the chicken. Cook for a few minutes until the oil separates from the yogurt.",
      "Add garam masala and cook for another 5 minutes, stirring occasionally.",
      "Garnish with fresh cilantro and serve hot with steamed rice or naan."
    ]
  },
  {
    "id": "9f4c0ce5-7b5d-40c3-b3ac-53a0073966e1",
    "name": "Scrambled Eggs with Spinach",
    "postedDate": 1698105600000,
    "ingredients": [
      "4 large eggs",
      "1 cup fresh spinach, chopped",
      "1/4 cup milk",
      "2 tbsp butter",
      "Salt and pepper to taste",
      "Grated cheese (optional)",
      "Sliced green onions for garnish (optional)"
    ],
    "instructions": [
      "In a bowl, beat the eggs and milk together until well combined. Season with salt and pepper.",
      "Heat a non-stick skillet over medium heat and melt the butter.",
      "Add the chopped spinach to the skillet and sauté until it wilts and becomes tender.",
      "Pour the beaten egg mixture over the spinach and let it cook without stirring for a moment until the edges begin to set.",
      "Gently stir the eggs with a spatula, continuing to cook until they reach your desired level of doneness.",
      "If desired, sprinkle grated cheese over the eggs and let it melt.",
      "Serve the scrambled eggs hot, garnished with sliced green onions, and enjoy your nutritious breakfast!"
    ]
  },
  {
    "id": "b46a0e09-1996-4317-82f3-2b70f7b14d0e",
    "name": "Spicy Vegetarian Szechuan Noodles",
    "postedDate": 1698105600000,
    "ingredients": [
      "200g dry egg noodles or udon noodles",
      "2 tbsp vegetable oil",
      "1/2 cup sliced bell peppers (red, green, or both)",
      "1/2 cup sliced carrots",
      "1/2 cup sliced broccoli florets",
      "1/2 cup sliced snap peas",
      "2 cloves garlic, minced",
      "1-inch piece of ginger, minced",
      "2-3 tbsp Szechuan sauce",
      "1 tbsp soy sauce",
      "1 tsp red chili flakes (adjust to your spice level)",
      "Salt to taste",
      "Fresh cilantro for garnish (optional)"
    ],
    "instructions": [
      "Cook the noodles according to the package instructions. Drain and set aside.",
      "In a large pan or wok, heat vegetable oil over medium-high heat.",
      "Add minced garlic and ginger, and sauté for a minute until fragrant.",
      "Add sliced vegetables (bell peppers, carrots, broccoli, and snap peas) and stir-fry for about 5-7 minutes until they start to become tender but remain crisp.",
      "Add the cooked noodles to the pan and toss with the vegetables.",
      "Stir in the Szechuan sauce, soy sauce, and red chili flakes. Adjust the spice level according to your preference.",
      "Cook for an additional 2-3 minutes, ensuring the noodles are well-coated with the sauce and everything is heated through.",
      "Taste and adjust salt if needed. If desired, garnish with fresh cilantro.",
      "Serve hot and enjoy the fiery flavor of these spicy Szechuan noodles!"
    ]
  },
  {
    "id": "4a39c7f0-10df-4976-844d-2f18ac4a502e",
    "name": "Jamaican Jerk Chicken",
    "postedDate": 1698105600000,
    "ingredients": [
      "4 bone-in chicken thighs or 2 chicken breasts",
      "4 green onions, chopped",
      "4 cloves garlic, minced",
      "2 Scotch bonnet peppers or habanero peppers, seeds removed and minced (adjust to your spice level)",
      "1/4 cup soy sauce",
      "2 tbsp vegetable oil",
      "2 tbsp brown sugar",
      "1 tbsp ground allspice",
      "1 tsp dried thyme",
      "1 tsp ground cinnamon",
      "1/2 tsp ground nutmeg",
      "Salt and black pepper to taste",
      "1 lime, juiced",
      "1/4 cup orange juice"
    ],
    "instructions": [
      "In a food processor, combine green onions, garlic, minced peppers, soy sauce, vegetable oil, brown sugar, allspice, thyme, cinnamon, nutmeg, salt, and black pepper. Blend until you have a smooth marinade.",
      "Place the chicken in a large resealable plastic bag or a shallow dish. Pour the marinade over the chicken, making sure it's well coated. Seal the bag or cover the dish and refrigerate for at least 2 hours, or overnight for best results.",
      "Preheat a grill to medium-high heat. Oil the grill grates to prevent sticking.",
      "Remove the chicken from the marinade, allowing any excess to drip off, and grill the chicken for about 6-8 minutes per side, or until fully cooked and juices run clear. Baste with the leftover marinade while grilling.",
      "In a small saucepan, heat the lime juice and orange juice over low heat until it reduces and thickens slightly.",
      "Serve the jerk chicken hot with the citrus reduction drizzled over it. You can also serve it with rice and peas or your favorite side dishes."
    ]
  }
]
